**주어진 데이터(basic2.csv)에서 새로운 컬럼(1일 이전 시차 컬럼)을 만들고, Events가 1이면서 Sales가 1000000이하인 조건에 맞는 새로운 컬럼 합을 구하시오**
- 데이터셋 : basic2.csv
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작

In [1]:
import pandas as pd

df = pd.read_csv('../dataset/basic2.csv', parse_dates=['Date'])
df.head()

        Date     Sales      PV      UV  Events
0 2022-01-01  22711525  397349  4421.0       1
1 2022-01-02     36779    3969  2289.0       0
2 2022-01-03  13943875  373890     NaN       1
3 2022-01-04   8088593  142054  2157.0       0
4 2022-01-05   2395374  190684     NaN       0

## User Code

## Solution

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730 entries, 0 to 729
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    730 non-null    datetime64[ns]
 1   Sales   730 non-null    int64
 2   PV      730 non-null    int64
 3   UV      684 non-null    float64
 4   Events  730 non-null    int64
dtypes: datetime64[ns](1), float64(1), int64(3)
memory usage: 28.6 KB

In [3]:
df.isnull().sum()

Date       0
Sales      0
PV         0
UV        46
Events     0
dtype: int64

In [4]:
#1일 차이가 나는 시차 특성 만들기
df['previous_PV'] = df['PV'].shift(1)
df.head()

        Date     Sales      PV      UV  Events  previous_PV
0 2022-01-01  22711525  397349  4421.0       1          NaN
1 2022-01-02     36779    3969  2289.0       0     397349.0
2 2022-01-03  13943875  373890     NaN       1       3969.0
3 2022-01-04   8088593  142054  2157.0       0     373890.0
4 2022-01-05   2395374  190684     NaN       0     142054.0

In [5]:
sum1 = df[(df['Events']==1) & (df['Sales']<=1000000)]['previous_PV'].sum()
sum1

1894876.0

In [6]:
# 1일 씩 미뤘음으로 가장 앞이 결측값이 됨 (바로 뒤의 값으로 채움)
df['previous_PV'] = df['previous_PV'].fillna(method = 'bfill')
df.head()

        Date     Sales      PV      UV  Events  previous_PV
0 2022-01-01  22711525  397349  4421.0       1     397349.0
1 2022-01-02     36779    3969  2289.0       0     397349.0
2 2022-01-03  13943875  373890     NaN       1       3969.0
3 2022-01-04   8088593  142054  2157.0       0     373890.0
4 2022-01-05   2395374  190684     NaN       0     142054.0

In [7]:
sum2 = df[(df['Events']==1) & (df['Sales']<=1000000)]['previous_PV'].sum()
sum2

1894876.0

In [8]:
sum1 - sum2

0.0